{
  "base_model_name_or_path": "microsoft/deberta-v2-xlarge",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "lora_alpha": 32,
  "lora_dropout": 0.1,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "target_modules": [
    "query_proj",
    "value_proj"
  ],
  "task_type": "SEQ_CLS"
}